width = 527
height = 460

labels_h2_places = {
	"Настройки модели": (40, 80),
	"Рендер": (290, 250),
	"Физика": (290, 80)
}
labels_h2_size = (200, 35)
labels_h2 = dict()

labels_places = {
	"dt": (20, 120),
	"t_max": (20, 150),
	"l": (280, 120),
	"alpha_start": (280, 150),
	"k": (280, 180),
	"m": (280, 210),
	"render_dt": (280, 290),
	"frames_count_fps": (260, 320)
}
labels_hints = {
	"dt": "Шаг симуляции. Должен быть как \nминимум на 3 порядка меньше `t_max`",
	"t_max": "Максимальное время симуляции",
	"l": "Длина маятника",
	"alpha_start": "Начальный угол отклонения маятника \nот положения равновесия",
	"k": "Коэффициент сопротивления воздуха",
	"m": "Масса груза на конце маятника",
	"render_dt": "Количество тактов, через которые \nбудет обновляться изображение на экране",
	"frames_count_fps": "Количество кадров, которые \nиспользуются для расчёта FPS"
}
labels_size = (100, 25)
labels = dict()

labels_units_places = {
	"с ": (200, 120),
	"с": (200, 150),
	"м": (460, 120),
	"рад": (460, 150),
	"кг/с": (460, 180),
	"кг": (460, 210),
}
labels_units_size = (30, 25)
labels_units = dict()

lineedits_places = {
	"dt": (120, 120),
	"t_max": (120, 150),
	"l": (380, 120),
	"alpha_start": (380, 150),
	"k": (380, 180),
	"m": (380, 210),
	"render_dt": (380, 290),
	"frames_count_fps": (380, 320),
}
lineedits_defaults = {
	"dt": '1e-5',
	"t_max": '15',
	"l": '9.8',
	"alpha_start": '1',
	"k": '0.6',
	"m": '1',
	"render_dt": '500',
	"frames_count_fps": '1000',
}
lineedits_size = (75, 25)
lineedit_variables = dict()
lineedits = dict()

checkboxes_info = {
	"theory": ("Расчитывать аналитическое решение", (40, 190)),
	"windage": ("Учитывать сопротивление воздуха", (40, 220)),
	"extremums": ("Отображать пики на графике", (280, 355)),
	"plot_animation": ("Показать анимацию движения", (280, 385)),
	"plot_alpha": ("Показать график угла от времени", (280, 415)),
}
checkboxes_size = (230, 30)
checkbox_variables = dict()
checkboxes = dict()

radios_info = {
	"linear": ("kv", (40, 300)),
	"quadratic": ("kv^2", (130, 300)),
	"realistic": ("реалистично", (40, 320))
}
radio_hints = {
	"linear": "Линейная зависимость силы \nсопротивления от скорости",
	"quadratic": "Квадратичная зависимость силы \nсопротивления от скорости",
	"realistic": "Наиболее реалистичная зависимость, \nполученная с помощью численного моделирования \nв профессиональных пакетах"
}
radios_size = (100, 25)
radios = dict()

button_place = (30, 355)
button_size = (192, 80)
